app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "How many licks does it take to get to the center of a tootsie roll pop?"], ["created_at", "2017-08-29 06:33:53.592954"], ["updated_at", "2017-08-29 06:33:53.592954"]]
---
  def create
    @survey = Survey.new(survey_params)

    respond_to do |format|
      if @survey.save

UPDATE "surveys" SET "name" = $1, "updated_at" = $2 WHERE "surveys"."id" = $3  [["name", "Tootsie Roll"], ["updated_at", "2017-08-29 07:01:24.301541"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @survey.update(survey_params)

DELETE FROM "surveys" WHERE "surveys"."id" = $1  [["id", 1]]
---
  def destroy
    @survey.destroy

SELECT "participants".* FROM "participants"
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def answers
    @participants = Participant.all
    @survey = Survey.find(params[:id])

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_survey
      @survey = Survey.find(params[:id])